hp-test.html
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2019-12-22 Sun 21:49 -->
<meta charset="utf-8" />
<title>Test Page</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yanyg" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://ycode.org"> HOME </a>
</div><div id="content">
<h1 class="title">Test Page</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org05bc4c2">1. Disqus</a></li>
</ul>
</div>
</div>
<p>
<a href="mailto:yygcode@gmail.com">mail</a>
</p>

<div id="outline-container-org05bc4c2" class="outline-2">
<h2 id="org05bc4c2"><span class="section-number-2">1</span> Disqus</h2>
<div class="outline-text-2" id="text-1">
<p class="verse">
The SFENCE (Store Fence) instruction controls write ordering by creating a fence<br />
for memory store operations. This instruction guarantees that the result of<br />
every store instruction that precedes the store fence in program order is<br />
globally visible before any store instruction that follows the fence. The SFENCE<br />
instruction provides an efficient way of ensuring ordering between procedures<br />
that produce weakly-ordered data and procedures that consume that data.<br />
</p>


<div class="org-center">
<blockquote>
<p>
The SFENCE (Store Fence) instruction controls write ordering by creating a fence
for memory store operations. This instruction guarantees that the result of
every store instruction that precedes the store fence in program order is
globally visible before any store instruction that follows the fence. The SFENCE
instruction provides an efficient way of ensuring ordering between procedures
that produce weakly-ordered data and procedures that consume that data.
</p>
</blockquote>
</div>

<pre class="example">
The SFENCE (Store Fence) instruction controls write ordering by creating a fence
for memory store operations. This instruction guarantees that the result of
every store instruction that precedes the store fence in program order is
globally visible before any store instruction that follows the fence. The SFENCE
instruction provides an efficient way of ensuring ordering between procedures
that produce weakly-ordered data and procedures that consume that data.
</pre>
</div>
</div>
</div>
</body>
</html>
